import { ISingleItem } from '../models/ISingleItem';

export const itemsToAddToCart = [
  {
    id: 1,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_47389001003_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Лосьон после бритья Nivea Men для чувствительной кожи',
    format: 'мл',
    size: 100,
    barcode: 331282,
    manufacturer: 'Beiersdorf',
    brand: 'NIVEA',
    description:
      'Формула лосьона с экстрактом ромашки и витамином Е обладает нейтральным запахом и обеспечивает ультрагладкое бритье. Уникальная серия средств для чувствительной кожи от NIVEA MEN разработана специально для мужчин, чья кожа склонна к раздражению. Благодаря натуральной ромашке продукты серии для чувствительной кожи успокаивают и защищают Вашу кожу.',
    price: 599,
    care: 'Уход за лицом',
    addedAmount: 1,
  },
  {
    id: 2,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_121315001001_01.png?maxwidth=1600&maxheight=1200&format=jpg&quality=90',
    name: 'Скраб талассо Geomar очищающий для тела',
    format: 'г',
    size: 600,
    barcode: 128238,
    manufacturer: 'Mirato Group',
    brand: 'Geomar',
    description:
      'Двухфазный скраб для тела с морской и английской солью, маслом из зерен кофе и фитоэкстрактами гуараны и паприки. Стимулирует обновление эпидермиса, выравнивает рельеф кожи, убирая эффект апельсиновой корки, увлажняет и питает. Регулярное использование, благодаря эффекту массажу и активным веществам в составе, помогает улучшать состояние кожи. Идеально подходит для подготовки кожи к последующим косметическим процедурам и максимизации результатов. Максимальный эффект возможно получить с использованием процедур обертывания с Грязью Водоросли Океана или Белая глина.',
    price: 1379,
    care: 'Уход за телом',
    addedAmount: 1,
  },
  {
    id: 3,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_235971001001_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Гель-уход для душа Nivea Увлажнение и Забота',
    format: 'мл',
    size: 750,
    barcode: 493371,
    manufacturer: 'Beiersdorf',
    brand: 'NIVEA',
    description:
      'Гель-уход для душа Увлажнение и Забота , обогащённый маслом миндаля, мягко очищает Вашу кожу и ухаживает за ней, делая её гладкой и шелковистой. Он смягчает кожу, защищает её от потери влаги и создаёт ощущение гармонии и спокойствия. Входящие в его состав компоненты дарят Вашей коже интенсивный уход и максимальное увлажнение!',
    price: 459,
    care: 'Уход за телом',
    addedAmount: 1,
  },
];

export const initialItems: ISingleItem[] = [
  {
    id: 10,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_428219001001_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Дезодорант-антиперспирант Axe Signature Gold',
    format: 'мл',
    size: 150,
    barcode: 586274,
    manufacturer: 'Unilever',
    brand: 'AXE',
    description:
      'Антиперспирант AXE SIGNATURE c тонким и изысканным ароматом агарового дерева и черной ванили. Не оставляет следов и пятен на одежде и защищает от пота на 48 часов, придавая уверенность в себе на весь день, каждый день и в любой ситуации. Раскрой свою индивидуальность и оставайся неподражаемым c AXE SIGNATURE!AXE – самый популярный мужской бренд в мире, знаменитый своими эксклюзивными ароматами и удивительными рекламными кампаниями. Каждый аромат AXE – это произведение искусства, созданное при участии легендарного парфюмера Энн Готлиб. В ассортименте бренда представлены все самые популярные форматы, существующие на рынке дезодорантов. Тем, кто ценит лучшие ароматы, AXE предлагает свои классические дезодоранты-спреи, разработанные при участи лучших парфюмерных домов мира. Аэрозоль Dark Temptation уже несколько лет является абсолютным бестселлером на рынке мужских дезодорантов. В 2018 году AXE запустил новый продукт – карандаши-дезодоранты в черных упаковках, которые повторяют три аромата-бестселлера AXE: Dark Temptation, Black и Anarchy. Дезодоранты AXE имеют антибактериальную формулу и препятствуют появлению неприятного запаха, но в то же время не содержат солей алюминия.',
    price: 399,
    care: 'Уход за телом',
  },
  {
    id: 11,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_135755001001_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Спонж Банные штучки для пилинга с водорослями',
    format: 'г',
    size: 31,
    barcode: 131057,
    manufacturer: 'БАННЫЕ ШТУЧКИ',
    brand: 'БАННЫЕ ШТУЧКИ',
    description:
      'Спонж Банные штучки для пилинга с водорослями, 14х10х2см представляет собой гипоаллергенное изделие, предназначенное для бани, сауны и ванной. Латекс в составе отсутствует. При помощи этого изделия можно эффективно отшелушить омертвевшие клетки и удалить скопление кожного сала. Благодаря глубокому очищению кожного покрова предотвращается закупорка пор и насыщение кожного покрова антиоксидантами. После каждого применения рекомендуется промыть изделие чистой водой и оставить высыхать. Поставляется в плотной упаковке.',
    price: 217,
    care: 'Уход за телом',
  },
  {
    id: 13,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_389947001001_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Крем-краска для волос Syoss Color 4-8 Каштановый шоколадный',
    format: 'мл',
    size: 50,
    barcode: 348541,
    manufacturer: 'Schwarzkopf & Henkel',
    brand: 'SYOSS',
    description:
      'Стойкая крем-краска для волос Syoss Каштановый шоколадный 4_8 с концентрированными цветовыми пигментами и системой против повреждений. Пигменты красителя глубоко проникают в волокна волоса, позволяя добиться интенсивности цвета до 10 недель и профессионального закрашивания седины. Ухаживающая технология Salonplex реставрирует повреждённые связи в структуре волоса и восстанавливает волосы изнутри. Формула с кератином покрывает кутикулу волос, делая их более мягкими и гладкими. Для визуально улучшенного качества волос* и до 80% меньше ломкости волос*. Подходит для волос от каштановых до чёрных оттенков. Для волос с любым содержанием седины. Стойкое окрашивание.*по сравнению с волосами, окрашенными без применения технологии Salonplex',
    price: 429,
    care: 'Уход заволосами',
  },
];

export const loadedItems: ISingleItem[] = [
  {
    id: 3,
    image:
      'https://cdn.metro-cc.ru/ru/ru_pim_235971001001_01.png?maxwidth=460&maxheight=460&format=jpg&quality=90',
    name: 'Гель-уход для душа Nivea Увлажнение и Забота',
    format: 'мл',
    size: 750,
    barcode: 493371,
    manufacturer: 'Beiersdorf',
    brand: 'NIVEA',
    description:
      'Гель-уход для душа Увлажнение и Забота , обогащённый маслом миндаля, мягко очищает Вашу кожу и ухаживает за ней, делая её гладкой и шелковистой. Он смягчает кожу, защищает её от потери влаги и создаёт ощущение гармонии и спокойствия. Входящие в его состав компоненты дарят Вашей коже интенсивный уход и максимальное увлажнение!',
    price: 459,
    care: 'Уход за телом',
  },
];
